RT-Thread/rt-thread/bsp/nuvoton_m05x/Libraries/CMSIS/Nuvoton/M051Series/Include/M051Series.h
} GCR_INT_T;

/** @addtogroup INT_CONST INT Bit Field Definition
  Constant Definitions for INT Controller
  @{
 */

/* INT NMI_SEL Bit Field Definitions */
#define INT_NMI_SEL_NMI_EN_Pos                  8                                       /*!< INT NMI_SEL: NMI_EN Position */
#define INT_NMI_SEL_NMI_EN_Msk                  (1ul << INT_NMI_SEL_NMI_EN_Pos)         /*!< INT NMI_SEL: NMI_EN Mask */

#define INT_NMI_SEL_NMI_SEL_Pos                 0                                       /*!< INT NMI_SEL: NMI_SEL Position */
#define INT_NMI_SEL_NMI_SEL_Msk                 (0x1Ful << INT_NMI_SEL_NMI_SEL_Pos)     /*!< INT NMI_SEL: NMI_SEL Mask */
/**@}*/ /* INT_CONST */


/**@}*/ /* GCR */


/*--------------------- General Purpose Input and Ouptut ---------------------*/
/** @addtogroup GPIO General Purpose Input and Ouptut(GPIO)
  Memory Mapped Structure for General Purpose I/O
  @{
 */
typedef struct
{
    /**
     * PMD
     * ===================================================================================================
     * Offset: 0x00  Port 0-4  I/O Mode Control
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[1:0]   |PMD0      |P0 I/O Pin[0] Mode Control
     * |        |          |Determine each I/O type of P0 pins
     * |        |          |00 = P0[0] pin is in INPUT mode.
     * |        |          |01 = P0[0] pin is in OUTPUT mode.
     * |        |          |10 = P0[0] pin is in Open-Drain mode.
     * |        |          |11 = P0[0] pin is in Quasi-bidirectional mode.
     * |[3:2]   |PMD1      |P0 I/O Pin[1] Mode Control
     * |        |          |Determine each I/O type of P0 pins
     * |        |          |00 = P0[1] pin is in INPUT mode.
     * |        |          |01 = P0[1] pin is in OUTPUT mode.
     * |        |          |10 = P0[1] pin is in Open-Drain mode.
     * |        |          |11 = P0[1] pin is in Quasi-bidirectional mode.
     * |[5:4]   |PMD2      |P0 I/O Pin[2] Mode Control
     * |        |          |Determine each I/O type of P0 pins
     * |        |          |00 = P0[2] pin is in INPUT mode.
     * |        |          |01 = P0[2] pin is in OUTPUT mode.
     * |        |          |10 = P0[2] pin is in Open-Drain mode.
     * |        |          |11 = P0[2] pin is in Quasi-bidirectional mode.
     * |[7:6]   |PMD3      |P0 I/O Pin[3] Mode Control
     * |        |          |Determine each I/O type of P0 pins
     * |        |          |00 = P0[3] pin is in INPUT mode.
     * |        |          |01 = P0[3] pin is in OUTPUT mode.
     * |        |          |10 = P0[3] pin is in Open-Drain mode.
     * |        |          |11 = P0[3] pin is in Quasi-bidirectional mode.
     * |[9:8]   |PMD4      |P0 I/O Pin[4] Mode Control
     * |        |          |Determine each I/O type of P0 pins
     * |        |          |00 = P0[4] pin is in INPUT mode.
     * |        |          |01 = P0[4] pin is in OUTPUT mode.
     * |        |          |10 = P0[4] pin is in Open-Drain mode.
     * |        |          |11 = P0[4] pin is in Quasi-bidirectional mode.
     * |[11:10] |PMD5      |P0 I/O Pin[5] Mode Control
     * |        |          |Determine each I/O type of P0 pins
     * |        |          |00 = P0[5] pin is in INPUT mode.
     * |        |          |01 = P0[5] pin is in OUTPUT mode.
     * |        |          |10 = P0[5] pin is in Open-Drain mode.
     * |        |          |11 = P0[5] pin is in Quasi-bidirectional mode.
     * |[13:12] |PMD6      |P0 I/O Pin[6] Mode Control
     * |        |          |Determine each I/O type of P0 pins
     * |        |          |00 = P0[6] pin is in INPUT mode.
     * |        |          |01 = P0[6] pin is in OUTPUT mode.
     * |        |          |10 = P0[6] pin is in Open-Drain mode.
     * |        |          |11 = P0[6] pin is in Quasi-bidirectional mode.
     * |[15:14] |PMD7      |P0 I/O Pin[7] Mode Control
     * |        |          |Determine each I/O type of P0 pins
     * |        |          |00 = P0[7] pin is in INPUT mode.
     * |        |          |01 = P0[7] pin is in OUTPUT mode.
     * |        |          |10 = P0[7] pin is in Open-Drain mode.
     * |        |          |11 = P0[7] pin is in Quasi-bidirectional mode.
     */
    __IO uint32_t  PMD;

    /**
     * OFFD
     * ===================================================================================================
     * Port 0-4 Digital Input Path Disable Control
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[23:16] |OFFD      |OFFD: P0 Pin OFF digital input path Enable
     * |        |          |1 = Disable IO digital input path (digital input tied to low)
     * |        |          |0 = Enable IO digital input path
     */
    __IO uint32_t  OFFD;

    /**
     * DOUT
     * ===================================================================================================
     * Port 0-4 Data Output Value
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |DOUT0     |P0 Pin[0] Output Value
     * |        |          |Each of these bits control the status of a P0 pin when the P0 pin is configures as output, open-drain
     * |        |          |and quasi-mode.
     * |        |          |1 = P0 Pin[0] will drive High if the corresponding output mode enabling bit is set.
     * |        |          |0 = P0 Pin[0] will drive Low if the corresponding output mode enabling bit is set.
     * |[1]     |DOUT1     |P0 Pin[1] Output Value
     * |        |          |Each of these bits control the status of a P0 pin when the P0 pin is configures as output, open-drain
     * |        |          |and quasi-mode.
     * |        |          |1 = P0 Pin[1] will drive High if the corresponding output mode enabling bit is set.
     * |        |          |0 = P0 Pin[1] will drive Low if the corresponding output mode enabling bit is set.
     * |[2]     |DOUT2     |P0 Pin[2] Output Value
     * |        |          |Each of these bits control the status of a P0 pin when the P0 pin is configures as output, open-drain
     * |        |          |and quasi-mode.
     * |        |          |1 = P0 Pin[2] will drive High if the corresponding output mode enabling bit is set.
     * |        |          |0 = P0 Pin[2] will drive Low if the corresponding output mode enabling bit is set.
     * |[3]     |DOUT3     |P0 Pin[3] Output Value
     * |        |          |Each of these bits control the status of a P0 pin when the P0 pin is configures as output, open-drain
     * |        |          |and quasi-mode.
     * |        |          |1 = P0 Pin[3] will drive High if the corresponding output mode enabling bit is set.
     * |        |          |0 = P0 Pin[3] will drive Low if the corresponding output mode enabling bit is set.
     * |[4]     |DOUT4     |P0 Pin[4] Output Value
     * |        |          |Each of these bits control the status of a P0 pin when the P0 pin is configures as output, open-drain
     * |        |          |and quasi-mode.
     * |        |          |1 = P0 Pin[4] will drive High if the corresponding output mode enabling bit is set.
     * |        |          |0 = P0 Pin[4] will drive Low if the corresponding output mode enabling bit is set.
     * |[5]     |DOUT5     |P0 Pin[5] Output Value
     * |        |          |Each of these bits control the status of a P0 pin when the P0 pin is configures as output, open-drain
     * |        |          |and quasi-mode.
     * |        |          |1 = P0 Pin[5] will drive High if the corresponding output mode enabling bit is set.
     * |        |          |0 = P0 Pin[5] will drive Low if the corresponding output mode enabling bit is set.
     * |[6]     |DOUT6     |P0 Pin[6] Output Value
     * |        |          |Each of these bits control the status of a P0 pin when the P0 pin is configures as output, open-drain
     * |        |          |and quasi-mode.
     * |        |          |1 = P0 Pin[6] will drive High if the corresponding output mode enabling bit is set.
     * |        |          |0 = P0 Pin[6] will drive Low if the corresponding output mode enabling bit is set.
     * |[7]     |DOUT7     |P0 Pin[7] Output Value
     * |        |          |Each of these bits control the status of a P0 pin when the P0 pin is configures as output, open-drain
     * |        |          |and quasi-mode.
     * |        |          |1 = P0 Pin[7] will drive High if the corresponding output mode enabling bit is set.
     * |        |          |0 = P0 Pin[7] will drive Low if the corresponding output mode enabling bit is set.
     */
    __IO uint32_t  DOUT;

    /**
     * DMASK
     * ===================================================================================================
     * Port0-4 Data Output Write Mask
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |DMASK0    |P0 Data Output Write Mask
     * |        |          |These bits are used to protect the corresponding register of P0_DOUT bit[0]. When set the
     * |        |          |DMASK bit[0] to "1", the corresponding DOUT0 bit is protected. The write signal is masked, write
     * |        |          |data to the protect bit is ignored
     * |        |          |0 = The corresponding P0_DOUT[0] bit can be updated
     * |        |          |1 = The corresponding P0_DOUT[0] bit is protected
     * |[1]     |DMASK1    |P0 Data Output Write Mask
     * |        |          |These bits are used to protect the corresponding register of P0_DOUT bit[1]. When set the
     * |        |          |DMASK bit[1] to "1", the corresponding DOUT1 bit is protected. The write signal is masked, write
     * |        |          |data to the protect bit is ignored
     * |        |          |0 = The corresponding P0_DOUT[1] bit can be updated
     * |        |          |1 = The corresponding P0_DOUT[1] bit is protected
     * |[2]     |DMASK2    |P0 Data Output Write Mask
     * |        |          |These bits are used to protect the corresponding register of P0_DOUT bit[2]. When set the
     * |        |          |DMASK bit[2] to "1", the corresponding DOUT2 bit is protected. The write signal is masked, write
     * |        |          |data to the protect bit is ignored
     * |        |          |0 = The corresponding P0_DOUT[2] bit can be updated
     * |        |          |1 = The corresponding P0_DOUT[2] bit is protected
     * |[3]     |DMASK3    |P0 Data Output Write Mask
     * |        |          |These bits are used to protect the corresponding register of P0_DOUT bit[3]. When set the
     * |        |          |DMASK bit[3] to "1", the corresponding DOUT3 bit is protected. The write signal is masked, write
     * |        |          |data to the protect bit is ignored
     * |        |          |0 = The corresponding P0_DOUT[3] bit can be updated
     * |        |          |1 = The corresponding P0_DOUT[3] bit is protected
     * |[4]     |DMASK4    |P0 Data Output Write Mask
     * |        |          |These bits are used to protect the corresponding register of P0_DOUT bit[4]. When set the
     * |        |          |DMASK bit[4] to "1", the corresponding DOUT4 bit is protected. The write signal is masked, write
     * |        |          |data to the protect bit is ignored
     * |        |          |0 = The corresponding P0_DOUT[4] bit can be updated
     * |        |          |1 = The corresponding P0_DOUT[4] bit is protected
     * |[5]     |DMASK5    |P0 Data Output Write Mask
     * |        |          |These bits are used to protect the corresponding register of P0_DOUT bit[6]. When set the
     * |        |          |DMASK bit[6] to "1", the corresponding DOUT6 bit is protected. The write signal is masked, write
     * |        |          |data to the protect bit is ignored
     * |        |          |0 = The corresponding P0_DOUT[6] bit can be updated
     * |        |          |1 = The corresponding P0_DOUT[6] bit is protected
     * |[6]     |DMASK6    |P0 Data Output Write Mask
     * |        |          |These bits are used to protect the corresponding register of P0_DOUT bit[6]. When set the
     * |        |          |DMASK bit[6] to "1", the corresponding DOUT6 bit is protected. The write signal is masked, write
     * |        |          |data to the protect bit is ignored
     * |        |          |0 = The corresponding P0_DOUT[6] bit can be updated
     * |        |          |1 = The corresponding P0_DOUT[6] bit is protected
     * |[7]     |DMASK7    |P0 Data Output Write Mask
     * |        |          |These bits are used to protect the corresponding register of P0_DOUT bit[7]. When set the
     * |        |          |DMASK bit[7] to "1", the corresponding DOUT7 bit is protected. The write signal is masked, write
     * |        |          |data to the protect bit is ignored
     * |        |          |0 = The corresponding P0_DOUT[7] bit can be updated
     * |        |          |1 = The corresponding P0_DOUT[7] bit is protected
     */
    __IO uint32_t  DMASK;

    /**
     * PIN;
     * ===================================================================================================
     * Port 0-4 Pin Value
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |PIN0      |P0 Pin Values
     * |        |          |The value read from each of these bit reflects the actual status of the respective P0 Pin[0].
     * |[1]     |PIN1      |P0 Pin Values
     * |        |          |The value read from each of these bit reflects the actual status of the respective P0 Pin[1].
     * |[2]     |PIN2      |P0 Pin Values
     * |        |          |The value read from each of these bit reflects the actual status of the respective P0 Pin[2].
     * |[3]     |PIN3      |P0 Pin Values
     * |        |          |The value read from each of these bit reflects the actual status of the respective P0 Pin[3].
     * |[4]     |PIN4      |P0 Pin Values
     * |        |          |The value read from each of these bit reflects the actual status of the respective P0 Pin[4].
     * |[5]     |PIN5      |P0 Pin Values
     * |        |          |The value read from each of these bit reflects the actual status of the respective P0 Pin[5].
     * |[6]     |PIN6      |P0 Pin Values
     * |        |          |The value read from each of these bit reflects the actual status of the respective P0 Pin[6].
     * |[7]     |PIN7      |P0 Pin Values
     * |        |          |The value read from each of these bit reflects the actual status of the respective P0 Pin[7].
     */
    __IO uint32_t  PIN;

    /**
     * DBEN
     * ===================================================================================================
     * Port 0-4 De-bounce Enable
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |DBEN0     |P0 Input Signal De-bounce Enable
     * |        |          |DBEN[0] used to enable the de-bounce function for each corresponding bit. if the input signal pulse
     * |        |          |width can't be sampled by continuous two de-bounce sample cycle. The input signal transition is seen
     * |        |          |as the signal bounce and will not trigger the interrupt.
     * |        |          |The DBEN[0] is used for "edge-trigger" interrupt only, and ignored for "level trigger" interrupt
     * |        |          |0 = The bit[0] de-bounce function is disabled
     * |        |          |1 = The bit[0] de-bounce function is enabled
     * |        |          |The de-bounce function is valid for edge triggered interrupt. if the interrupt mode is level triggered,
     * |        |          |the de-bounce enable bit is ignored.
     * |[1]     |DBEN1     |P0 Input Signal De-bounce Enable
     * |        |          |DBEN[1] used to enable the de-bounce function for each corresponding bit. if the input signal pulse
     * |        |          |width can't be sampled by continuous two de-bounce sample cycle. The input signal transition is seen
     * |        |          |as the signal bounce and will not trigger the interrupt.
     * |        |          |The DBEN[1] is used for "edge-trigger" interrupt only, and ignored for "level trigger" interrupt
     * |        |          |0 = The bit[1] de-bounce function is disabled
     * |        |          |1 = The bit[1] de-bounce function is enabled
     * |        |          |The de-bounce function is valid for edge triggered interrupt. if the interrupt mode is level triggered,
     * |        |          |the de-bounce enable bit is ignored.
     * |[2]     |DBEN2     |P0 Input Signal De-bounce Enable
     * |        |          |DBEN[2] used to enable the de-bounce function for each corresponding bit. if the input signal pulse
     * |        |          |width can't be sampled by continuous two de-bounce sample cycle. The input signal transition is seen
     * |        |          |as the signal bounce and will not trigger the interrupt.
     * |        |          |The DBEN[2] is used for "edge-trigger" interrupt only, and ignored for "level trigger" interrupt
     * |        |          |0 = The bit[2] de-bounce function is disabled
     * |        |          |1 = The bit[2] de-bounce function is enabled
     * |        |          |The de-bounce function is valid for edge triggered interrupt. if the interrupt mode is level triggered,
     * |        |          |the de-bounce enable bit is ignored.
     * |[3]     |DBEN3     |P0 Input Signal De-bounce Enable
     * |        |          |DBEN[3] used to enable the de-bounce function for each corresponding bit. if the input signal pulse
     * |        |          |width can't be sampled by continuous two de-bounce sample cycle. The input signal transition is seen
     * |        |          |as the signal bounce and will not trigger the interrupt.
     * |        |          |The DBEN[3] is used for "edge-trigger" interrupt only, and ignored for "level trigger" interrupt
     * |        |          |0 = The bit[3] de-bounce function is disabled
     * |        |          |1 = The bit[3] de-bounce function is enabled
     * |        |          |The de-bounce function is valid for edge triggered interrupt. if the interrupt mode is level triggered,
     * |        |          |the de-bounce enable bit is ignored.
     * |[4]     |DBEN4     |P0 Input Signal De-bounce Enable
     * |        |          |DBEN[4] used to enable the de-bounce function for each corresponding bit. if the input signal pulse
     * |        |          |width can't be sampled by continuous two de-bounce sample cycle. The input signal transition is seen
     * |        |          |as the signal bounce and will not trigger the interrupt.
     * |        |          |The DBEN[4] is used for "edge-trigger" interrupt only, and ignored for "level trigger" interrupt
     * |        |          |0 = The bit[4] de-bounce function is disabled
     * |        |          |1 = The bit[4] de-bounce function is enabled
     * |        |          |The de-bounce function is valid for edge triggered interrupt. if the interrupt mode is level triggered,
     * |        |          |the de-bounce enable bit is ignored.
     * |[5]     |DBEN5     |P0 Input Signal De-bounce Enable
     * |        |          |DBEN[5] used to enable the de-bounce function for each corresponding bit. if the input signal pulse
     * |        |          |width can't be sampled by continuous two de-bounce sample cycle. The input signal transition is seen
     * |        |          |as the signal bounce and will not trigger the interrupt.
     * |        |          |The DBEN[5] is used for "edge-trigger" interrupt only, and ignored for "level trigger" interrupt
     * |        |          |0 = The bit[5] de-bounce function is disabled
     * |        |          |1 = The bit[5] de-bounce function is enabled
     * |        |          |The de-bounce function is valid for edge triggered interrupt. if the interrupt mode is level triggered,
     * |        |          |the de-bounce enable bit is ignored.
     * |[6]     |DBEN6     |P0 Input Signal De-bounce Enable
     * |        |          |DBEN[6] used to enable the de-bounce function for each corresponding bit. if the input signal pulse
     * |        |          |width can't be sampled by continuous two de-bounce sample cycle. The input signal transition is seen
     * |        |          |as the signal bounce and will not trigger the interrupt.
     * |        |          |The DBEN[6] is used for "edge-trigger" interrupt only, and ignored for "level trigger" interrupt
     * |        |          |0 = The bit[6] de-bounce function is disabled
     * |        |          |1 = The bit[6] de-bounce function is enabled
     * |        |          |The de-bounce function is valid for edge triggered interrupt. if the interrupt mode is level triggered,
     * |        |          |the de-bounce enable bit is ignored.
     * |[7]     |DBEN7     |P0 Input Signal De-bounce Enable
     * |        |          |DBEN[7] used to enable the de-bounce function for each corresponding bit. if the input signal pulse
     * |        |          |width can't be sampled by continuous two de-bounce sample cycle. The input signal transition is seen
     * |        |          |as the signal bounce and will not trigger the interrupt.
     * |        |          |The DBEN[7] is used for "edge-trigger" interrupt only, and ignored for "level trigger" interrupt
     * |        |          |0 = The bit[7] de-bounce function is disabled
     * |        |          |1 = The bit[7] de-bounce function is enabled
     * |        |          |The de-bounce function is valid for edge triggered interrupt. if the interrupt mode is level triggered,
     * |        |          |the de-bounce enable bit is ignored.
     */
    __IO uint32_t  DBEN;

