RT-Thread/rt-thread/bsp/nuvoton_m05x/Libraries/CMSIS/Nuvoton/M051Series/Include/M051Series.h
    /**
     * IMD
     * ===================================================================================================
     * Port 0-4 Interrupt Mode Control
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |IMD0      |Port 0 Interrupt Mode Control
     * |        |          |IMD[0] used to control the interrupt is by level trigger or by edge trigger. If the interrupt is by edge
     * |        |          |trigger, the trigger souce is control de-bounce. If the interrupt is by level trigger, the input source is
     * |        |          |sampled by one clock and the generate the interrupt
     * |        |          |0 = Edge trigger interrupt
     * |        |          |1 = Level trigger interrupt
     * |        |          |if set pin as the level trigger interrupt, then only one level can be set on the registers P0_IEN.
     * |        |          |if set both the level to trigger interrupt, the setting is ignored and no interrupt will occur.
     * |        |          |The de-bounce function is valid for edge triggered interrupt. if the interrupt mode is level triggered, the
     * |        |          |de-bounce enable bit is ignored.
     * |[1]     |IMD1      |Port 0 Interrupt Mode Control
     * |        |          |IMD[1] used to control the interrupt is by level trigger or by edge trigger. If the interrupt is by edge
     * |        |          |trigger, the trigger souce is control de-bounce. If the interrupt is by level trigger, the input source is
     * |        |          |sampled by one clock and the generate the interrupt
     * |        |          |0 = Edge trigger interrupt
     * |        |          |1 = Level trigger interrupt
     * |        |          |if set pin as the level trigger interrupt, then only one level can be set on the registers P0_IEN.
     * |        |          |if set both the level to trigger interrupt, the setting is ignored and no interrupt will occur.
     * |        |          |The de-bounce function is valid for edge triggered interrupt. if the interrupt mode is level triggered, the
     * |        |          |de-bounce enable bit is ignored.
     * |[2]     |IMD2      |Port 0 Interrupt Mode Control
     * |        |          |IMD[2] used to control the interrupt is by level trigger or by edge trigger. If the interrupt is by edge
     * |        |          |trigger, the trigger souce is control de-bounce. If the interrupt is by level trigger, the input source is
     * |        |          |sampled by one clock and the generate the interrupt
     * |        |          |0 = Edge trigger interrupt
     * |        |          |1 = Level trigger interrupt
     * |        |          |if set pin as the level trigger interrupt, then only one level can be set on the registers P0_IEN.
     * |        |          |if set both the level to trigger interrupt, the setting is ignored and no interrupt will occur.
     * |        |          |The de-bounce function is valid for edge triggered interrupt. if the interrupt mode is level triggered, the
     * |        |          |de-bounce enable bit is ignored.
     * |[3]     |IMD3      |Port 0 Interrupt Mode Control
     * |        |          |IMD[3] used to control the interrupt is by level trigger or by edge trigger. If the interrupt is by edge
     * |        |          |trigger, the trigger souce is control de-bounce. If the interrupt is by level trigger, the input source is
     * |        |          |sampled by one clock and the generate the interrupt
     * |        |          |0 = Edge trigger interrupt
     * |        |          |1 = Level trigger interrupt
     * |        |          |if set pin as the level trigger interrupt, then only one level can be set on the registers P0_IEN.
     * |        |          |if set both the level to trigger interrupt, the setting is ignored and no interrupt will occur.
     * |        |          |The de-bounce function is valid for edge triggered interrupt. if the interrupt mode is level triggered, the
     * |        |          |de-bounce enable bit is ignored.
     * |[4]     |IMD4      |Port 0 Interrupt Mode Control
     * |        |          |IMD[4] used to control the interrupt is by level trigger or by edge trigger. If the interrupt is by edge
     * |        |          |trigger, the trigger souce is control de-bounce. If the interrupt is by level trigger, the input source is
     * |        |          |sampled by one clock and the generate the interrupt
     * |        |          |0 = Edge trigger interrupt
     * |        |          |1 = Level trigger interrupt
     * |        |          |if set pin as the level trigger interrupt, then only one level can be set on the registers P0_IEN.
     * |        |          |if set both the level to trigger interrupt, the setting is ignored and no interrupt will occur.
     * |        |          |The de-bounce function is valid for edge triggered interrupt. if the interrupt mode is level triggered, the
     * |        |          |de-bounce enable bit is ignored.
     * |[5]     |IMD5      |Port 0 Interrupt Mode Control
     * |        |          |IMD[5] used to control the interrupt is by level trigger or by edge trigger. If the interrupt is by edge
     * |        |          |trigger, the trigger souce is control de-bounce. If the interrupt is by level trigger, the input source is
     * |        |          |sampled by one clock and the generate the interrupt
     * |        |          |0 = Edge trigger interrupt
     * |        |          |1 = Level trigger interrupt
     * |        |          |if set pin as the level trigger interrupt, then only one level can be set on the registers P0_IEN.
     * |        |          |if set both the level to trigger interrupt, the setting is ignored and no interrupt will occur.
     * |        |          |The de-bounce function is valid for edge triggered interrupt. if the interrupt mode is level triggered, the
     * |        |          |de-bounce enable bit is ignored.
     * |[6]     |IMD6      |Port 0 Interrupt Mode Control
     * |        |          |IMD[6] used to control the interrupt is by level trigger or by edge trigger. If the interrupt is by edge
     * |        |          |trigger, the trigger souce is control de-bounce. If the interrupt is by level trigger, the input source is
     * |        |          |sampled by one clock and the generate the interrupt
     * |        |          |0 = Edge trigger interrupt
     * |        |          |1 = Level trigger interrupt
     * |        |          |if set pin as the level trigger interrupt, then only one level can be set on the registers P0_IEN.
     * |        |          |if set both the level to trigger interrupt, the setting is ignored and no interrupt will occur.
     * |        |          |The de-bounce function is valid for edge triggered interrupt. if the interrupt mode is level triggered, the
     * |        |          |de-bounce enable bit is ignored.
     * |[7]     |IMD7      |Port 0 Interrupt Mode Control
     * |        |          |IMD[7] used to control the interrupt is by level trigger or by edge trigger. If the interrupt is by edge
     * |        |          |trigger, the trigger souce is control de-bounce. If the interrupt is by level trigger, the input source is
     * |        |          |sampled by one clock and the generate the interrupt
     * |        |          |0 = Edge trigger interrupt
     * |        |          |1 = Level trigger interrupt
     * |        |          |if set pin as the level trigger interrupt, then only one level can be set on the registers P0_IEN.
     * |        |          |if set both the level to trigger interrupt, the setting is ignored and no interrupt will occur.
     * |        |          |The de-bounce function is valid for edge triggered interrupt. if the interrupt mode is level triggered, the
     * |        |          |de-bounce enable bit is ignored.
     */
    __IO uint32_t  IMD;

    /**
     * IEN
     * ===================================================================================================
     * Port 0-4 Interrupt Enable Control
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |IF_EN0    |Port0 Interrupt Enable by Input Falling Edge or Input Level Low
     * |        |          |IF_EN[0] used to enable the interrupt for each of the corresponding input P0[0]. Set bit "1" also
     * |        |          |enable the pin wakeup function.
     * |        |          |When set the IF_EN[0] bit "1":
     * |        |          |If the interrupt is level mode trigger, the input P0[0] state at level "low" will generate the interrupt.
     * |        |          |If the interrupt is edge mode trigger, the input P0[0] state change from "high-to-low" will generate
     * |        |          |the interrupt.
     * |        |          |1 = Enable the P0[0] state low-level or high-to-low change interrupt
     * |        |          |0 = Disable the P0[0] state low-level or high-to-low change interrupt
     * |[1]     |IF_EN1    |Port0 Interrupt Enable by Input Falling Edge or Input Level Low
     * |        |          |IF_EN[1] used to enable the interrupt for each of the corresponding input P0[1]. Set bit "1" also
     * |        |          |enable the pin wakeup function.
     * |        |          |When set the IF_EN[1] bit "1":
     * |        |          |If the interrupt is level mode trigger, the input P0[1] state at level "low" will generate the interrupt.
     * |        |          |If the interrupt is edge mode trigger, the input P0[1] state change from "high-to-low" will generate
     * |        |          |the interrupt.
     * |        |          |1 = Enable the P0[1] state low-level or high-to-low change interrupt
     * |        |          |0 = Disable the P0[1] state low-level or high-to-low change interrupt
     * |[2]     |IF_EN2    |Port0 Interrupt Enable by Input Falling Edge or Input Level Low
     * |        |          |IF_EN[2] used to enable the interrupt for each of the corresponding input P0[2]. Set bit "1" also
     * |        |          |enable the pin wakeup function.
     * |        |          |When set the IF_EN[2] bit "1":
     * |        |          |If the interrupt is level mode trigger, the input P0[2] state at level "low" will generate the interrupt.
     * |        |          |If the interrupt is edge mode trigger, the input P0[2] state change from "high-to-low" will generate
     * |        |          |the interrupt.
     * |        |          |1 = Enable the P0[2] state low-level or high-to-low change interrupt
     * |        |          |0 = Disable the P0[2] state low-level or high-to-low change interrupt
     * |[3]     |IF_EN3    |Port0 Interrupt Enable by Input Falling Edge or Input Level Low
     * |        |          |IF_EN[3] used to enable the interrupt for each of the corresponding input P0[3]. Set bit "1" also
     * |        |          |enable the pin wakeup function.
     * |        |          |When set the IF_EN[3] bit "1":
     * |        |          |If the interrupt is level mode trigger, the input P0[3] state at level "low" will generate the interrupt.
     * |        |          |If the interrupt is edge mode trigger, the input P0[3] state change from "high-to-low" will generate
     * |        |          |the interrupt.
     * |        |          |1 = Enable the P0[3] state low-level or high-to-low change interrupt
     * |        |          |0 = Disable the P0[3] state low-level or high-to-low change interrupt
     * |[4]     |IF_EN4    |Port0 Interrupt Enable by Input Falling Edge or Input Level Low
     * |        |          |IF_EN[4] used to enable the interrupt for each of the corresponding input P0[4]. Set bit "1" also
     * |        |          |enable the pin wakeup function.
     * |        |          |When set the IF_EN[4] bit "1":
     * |        |          |If the interrupt is level mode trigger, the input P0[4] state at level "low" will generate the interrupt.
     * |        |          |If the interrupt is edge mode trigger, the input P0[4] state change from "high-to-low" will generate
     * |        |          |the interrupt.
     * |        |          |1 = Enable the P0[4] state low-level or high-to-low change interrupt
     * |        |          |0 = Disable the P0[4] state low-level or high-to-low change interrupt
     * |[5]     |IF_EN5    |Port0 Interrupt Enable by Input Falling Edge or Input Level Low
     * |        |          |IF_EN[5] used to enable the interrupt for each of the corresponding input P0[5]. Set bit "1" also
     * |        |          |enable the pin wakeup function.
     * |        |          |When set the IF_EN[5] bit "1":
     * |        |          |If the interrupt is level mode trigger, the input P0[5] state at level "low" will generate the interrupt.
     * |        |          |If the interrupt is edge mode trigger, the input P0[5] state change from "high-to-low" will generate
     * |        |          |the interrupt.
     * |        |          |1 = Enable the P0[5] state low-level or high-to-low change interrupt
     * |        |          |0 = Disable the P0[5] state low-level or high-to-low change interrupt
     * |[6]     |IF_EN6    |Port0 Interrupt Enable by Input Falling Edge or Input Level Low
     * |        |          |IF_EN[6] used to enable the interrupt for each of the corresponding input P0[6]. Set bit "1" also
     * |        |          |enable the pin wakeup function.
     * |        |          |When set the IF_EN[6] bit "1":
     * |        |          |If the interrupt is level mode trigger, the input P0[6] state at level "low" will generate the interrupt.
     * |        |          |If the interrupt is edge mode trigger, the input P0[6] state change from "high-to-low" will generate
     * |        |          |the interrupt.
     * |        |          |1 = Enable the P0[6] state low-level or high-to-low change interrupt
     * |        |          |0 = Disable the P0[6] state low-level or high-to-low change interrupt
     * |[7]     |IF_EN7    |Port0 Interrupt Enable by Input Falling Edge or Input Level Low
     * |        |          |IF_EN[7] used to enable the interrupt for each of the corresponding input P0[7]. Set bit "1" also
     * |        |          |enable the pin wakeup function.
     * |        |          |When set the IF_EN[7] bit "1":
     * |        |          |If the interrupt is level mode trigger, the input P0[7] state at level "low" will generate the interrupt.
     * |        |          |If the interrupt is edge mode trigger, the input P0[7] state change from "high-to-low" will generate
     * |        |          |the interrupt.
     * |        |          |1 = Enable the P0[7] state low-level or high-to-low change interrupt
     * |        |          |0 = Disable the P0[7] state low-level or high-to-low change interrupt
     * |[16]    |IR_EN0    |Port 0 Interrupt Enable by Input Rising Edge or Input Level High
     * |        |          |IR_EN[0] used to enable the interrupt for each of the corresponding input P0[0]. Set bit "1" also
     * |        |          |enable the pin wakeup function.
     * |        |          |When set the IR_EN[0] bit "1":
     * |        |          |If the interrupt is level mode trigger, the input P0[0] state at level "high" will generate the interrupt.
     * |        |          |If the interrupt is edge mode trigger, the input P0[0] state change from "low-to-high" will generate
     * |        |          |the interrupt.
     * |        |          |1 = Enable the P0[0] level-high or low-to-high interrupt
     * |        |          |0 = Disable the P0[0] level-high or low-to-high interrupt
     * |[17]    |IR_EN1    |Port 0 Interrupt Enable by Input Rising Edge or Input Level High
     * |        |          |IR_EN[1] used to enable the interrupt for each of the corresponding input P0[1]. Set bit "1" also
     * |        |          |enable the pin wakeup function.
     * |        |          |When set the IR_EN[1] bit "1":
     * |        |          |If the interrupt is level mode trigger, the input P0[1] state at level "high" will generate the interrupt.
     * |        |          |If the interrupt is edge mode trigger, the input P0[1] state change from "low-to-high" will generate
     * |        |          |the interrupt.
     * |        |          |1 = Enable the P0[1] level-high or low-to-high interrupt
     * |        |          |0 = Disable the P0[1] level-high or low-to-high interrupt
     * |[18]    |IR_EN2    |Port 0 Interrupt Enable by Input Rising Edge or Input Level High
     * |        |          |IR_EN[2] used to enable the interrupt for each of the corresponding input P0[2]. Set bit "1" also
     * |        |          |enable the pin wakeup function.
     * |        |          |When set the IR_EN[2] bit "1":
     * |        |          |If the interrupt is level mode trigger, the input P0[2] state at level "high" will generate the interrupt.
     * |        |          |If the interrupt is edge mode trigger, the input P0[2] state change from "low-to-high" will generate
     * |        |          |the interrupt.
     * |        |          |1 = Enable the P0[2] level-high or low-to-high interrupt
     * |        |          |0 = Disable the P0[2] level-high or low-to-high interrupt
     * |[19]    |IR_EN3    |Port 0 Interrupt Enable by Input Rising Edge or Input Level High
     * |        |          |IR_EN[3] used to enable the interrupt for each of the corresponding input P0[3]. Set bit "1" also
     * |        |          |enable the pin wakeup function.
     * |        |          |When set the IR_EN[3] bit "1":
     * |        |          |If the interrupt is level mode trigger, the input P0[3] state at level "high" will generate the interrupt.
     * |        |          |If the interrupt is edge mode trigger, the input P0[3] state change from "low-to-high" will generate
     * |        |          |the interrupt.
     * |        |          |1 = Enable the P0[3] level-high or low-to-high interrupt
     * |        |          |0 = Disable the P0[3] level-high or low-to-high interrupt
     * |[20]    |IR_EN4    |Port 0 Interrupt Enable by Input Rising Edge or Input Level High
     * |        |          |IR_EN[4] used to enable the interrupt for each of the corresponding input P0[4]. Set bit "1" also
     * |        |          |enable the pin wakeup function.
     * |        |          |When set the IR_EN[4] bit "1":
     * |        |          |If the interrupt is level mode trigger, the input P0[4] state at level "high" will generate the interrupt.
     * |        |          |If the interrupt is edge mode trigger, the input P0[4] state change from "low-to-high" will generate
     * |        |          |the interrupt.
     * |        |          |1 = Enable the P0[4] level-high or low-to-high interrupt
     * |        |          |0 = Disable the P0[4] level-high or low-to-high interrupt
     * |[21]    |IR_EN5    |Port 0 Interrupt Enable by Input Rising Edge or Input Level High
     * |        |          |IR_EN[5] used to enable the interrupt for each of the corresponding input P0[5]. Set bit "1" also
     * |        |          |enable the pin wakeup function.
     * |        |          |When set the IR_EN[5] bit "1":
     * |        |          |If the interrupt is level mode trigger, the input P0[5] state at level "high" will generate the interrupt.
     * |        |          |If the interrupt is edge mode trigger, the input P0[5] state change from "low-to-high" will generate
     * |        |          |the interrupt.
     * |        |          |1 = Enable the P0[5] level-high or low-to-high interrupt
     * |        |          |0 = Disable the P0[5] level-high or low-to-high interrupt
     * |[22]    |IR_EN6    |Port 0 Interrupt Enable by Input Rising Edge or Input Level High
     * |        |          |IR_EN[6] used to enable the interrupt for each of the corresponding input P0[6]. Set bit "1" also
     * |        |          |enable the pin wakeup function.
     * |        |          |When set the IR_EN[6] bit "1":
     * |        |          |If the interrupt is level mode trigger, the input P0[6] state at level "high" will generate the interrupt.
     * |        |          |If the interrupt is edge mode trigger, the input P0[6] state change from "low-to-high" will generate
     * |        |          |the interrupt.
     * |        |          |1 = Enable the P0[6] level-high or low-to-high interrupt
     * |        |          |0 = Disable the P0[6] level-high or low-to-high interrupt
     * |[23]    |IR_EN7    |Port 0 Interrupt Enable by Input Rising Edge or Input Level High
     * |        |          |IR_EN[7] used to enable the interrupt for each of the corresponding input P0[7]. Set bit "1" also
     * |        |          |enable the pin wakeup function.
     * |        |          |When set the IR_EN[7] bit "1":
     * |        |          |If the interrupt is level mode trigger, the input P0[7] state at level "high" will generate the interrupt.
     * |        |          |If the interrupt is edge mode trigger, the input P0[7] state change from "low-to-high" will generate
     * |        |          |the interrupt.
     * |        |          |1 = Enable the P0[7] level-high or low-to-high interrupt
     * |        |          |0 = Disable the P0[7] level-high or low-to-high interrupt
     */
    __IO uint32_t  IEN;

