RT-Thread/rt-thread/bsp/nuvoton_m05x/Libraries/CMSIS/Nuvoton/M051Series/Include/M051Series.h
    /**
     * ISRC
     * ===================================================================================================
     * Port 0-4 Interrupt Trigger Source
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |ISRC0     |Port 0 Interrupt Trigger Source Indicator
     * |        |          |Read:
     * |        |          |1 = Indicates P0[0] generate an interrupt
     * |        |          |0 = No interrupt at P0[0]
     * |        |          |Write:
     * |        |          |1 = Clear the correspond pending interrupt
     * |        |          |0 = No action
     * |[1]     |ISRC1     |Port 0 Interrupt Trigger Source Indicator
     * |        |          |Read:
     * |        |          |1 = Indicates P0[1] generate an interrupt
     * |        |          |0 = No interrupt at P0[1]
     * |        |          |Write:
     * |        |          |1 = Clear the correspond pending interrupt
     * |        |          |0 = No action
     * |[2]     |ISRC2     |Port 0 Interrupt Trigger Source Indicator
     * |        |          |Read:
     * |        |          |1 = Indicates P0[2] generate an interrupt
     * |        |          |0 = No interrupt at P0[2]
     * |        |          |Write:
     * |        |          |1 = Clear the correspond pending interrupt
     * |        |          |0 = No action
     * |[3]     |ISRC3     |Port 0 Interrupt Trigger Source Indicator
     * |        |          |Read:
     * |        |          |1 = Indicates P0[3] generate an interrupt
     * |        |          |0 = No interrupt at P0[3]
     * |        |          |Write:
     * |        |          |1 = Clear the correspond pending interrupt
     * |        |          |0 = No action
     * |[4]     |ISRC4     |Port 0 Interrupt Trigger Source Indicator
     * |        |          |Read:
     * |        |          |1 = Indicates P0[4] generate an interrupt
     * |        |          |0 = No interrupt at P0[4]
     * |        |          |Write:
     * |        |          |1 = Clear the correspond pending interrupt
     * |        |          |0 = No action
     * |[5]     |ISRC5     |Port 0 Interrupt Trigger Source Indicator
     * |        |          |Read:
     * |        |          |1 = Indicates P0[5] generate an interrupt
     * |        |          |0 = No interrupt at P0[5]
     * |        |          |Write:
     * |        |          |1 = Clear the correspond pending interrupt
     * |        |          |0 = No action
     * |[6]     |ISRC6     |Port 0 Interrupt Trigger Source Indicator
     * |        |          |Read:
     * |        |          |1 = Indicates P0[6] generate an interrupt
     * |        |          |0 = No interrupt at P0[6]
     * |        |          |Write:
     * |        |          |1 = Clear the correspond pending interrupt
     * |        |          |0 = No action
     * |[7]     |ISRC7     |Port 0 Interrupt Trigger Source Indicator
     * |        |          |Read:
     * |        |          |1 = Indicates P0[7] generate an interrupt
     * |        |          |0 = No interrupt at P0[7]
     * |        |          |Write:
     * |        |          |1 = Clear the correspond pending interrupt
     * |        |          |0 = No action
     */
    __IO uint32_t  ISRC;
} GPIO_T;

typedef struct
{
    /**
     * DBNCECON
     * ===================================================================================================
     * Offset: 0x180 Interrupt De-bounce Cycle Control
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[3:0]   |DBCLKSEL  |De-bounce sampling cycle selection
     * |        |          |DBCLKSEL
     * |        |          |Description
     * |        |          |0 = Sample interrupt input once per 1 clocks
     * |        |          |1 = Sample interrupt input once per 2 clocks
     * |        |          |2 = Sample interrupt input once per 4 clocks
     * |        |          |3 = Sample interrupt input once per 8 clocks
     * |        |          |4 = Sample interrupt input once per 16 clocks
     * |        |          |5 = Sample interrupt input once per 32 clocks
     * |        |          |6 = Sample interrupt input once per 64 clocks
     * |        |          |7 = Sample interrupt input once per 128 clocks
     * |        |          |8 = Sample interrupt input once per 256 clocks
     * |        |          |9 = Sample interrupt input once per 2*256 clocks
     * |        |          |10 = Sample interrupt input once per 4*256clocks
     * |        |          |11 = Sample interrupt input once per 8*256 clocks
     * |        |          |12 = Sample interrupt input once per 16*256 clocks
     * |        |          |13 = Sample interrupt input once per 32*256 clocks
     * |        |          |14 = Sample interrupt input once per 64*256 clocks
     * |        |          |15 = Sample interrupt input once per 128*256 clocks
     * |[4]     |DBCLKSRC  |De-bounce counter clock source select
     * |        |          |1 = De-bounce counter clock source is the internal 10KHz clock
     * |        |          |0 = De-bounce counter clock source is the HCLK
     * |[5]     |ICLK_ON   |Interrupt clock On mode
     * |        |          |Set this bit "0" will disable the interrupt generate circuit clock, if the pin[n] interrupt is disabled
     * |        |          |0 = disable the clock if the P0/1/2/3/4[n] interrupt is disabled
     * |        |          |1 = interrupt generated circuit clock always enable
     * |        |          |n=0~7
     * ---------------------------------------------------------------------------------------------------
     */
    __IO uint32_t  DBNCECON;
} GPIO_DBNCECON_T;


/** @addtogroup GPIO_CONST GPIO Bit Field Definition
  Constant Definitions for GPIO Controller
  @{
 */

/* GPIO PMD Bit Field Definitions */
#define GPIO_PMD_PMD7_Pos           14                                          /*!< GPIO PMD: PMD7 Position */
#define GPIO_PMD_PMD7_Msk           (0x3ul << GPIO_PMD_PMD7_Pos)                /*!< GPIO PMD: PMD7 Mask */

#define GPIO_PMD_PMD6_Pos           12                                          /*!< GPIO PMD: PMD6 Position */
#define GPIO_PMD_PMD6_Msk           (0x3ul << GPIO_PMD_PMD6_Pos)                /*!< GPIO PMD: PMD6 Mask */

#define GPIO_PMD_PMD5_Pos           10                                          /*!< GPIO PMD: PMD5 Position */
#define GPIO_PMD_PMD5_Msk           (0x3ul << GPIO_PMD_PMD5_Pos)                /*!< GPIO PMD: PMD5 Mask */

#define GPIO_PMD_PMD4_Pos           8                                           /*!< GPIO PMD: PMD4 Position */
#define GPIO_PMD_PMD4_Msk           (0x3ul << GPIO_PMD_PMD4_Pos)                /*!< GPIO PMD: PMD4 Mask */

#define GPIO_PMD_PMD3_Pos           6                                           /*!< GPIO PMD: PMD3 Position */
#define GPIO_PMD_PMD3_Msk           (0x3ul << GPIO_PMD_PMD3_Pos)                /*!< GPIO PMD: PMD3 Mask */

#define GPIO_PMD_PMD2_Pos           4                                           /*!< GPIO PMD: PMD2 Position */
#define GPIO_PMD_PMD2_Msk           (0x3ul << GPIO_PMD_PMD2_Pos)                /*!< GPIO PMD: PMD2 Mask */

#define GPIO_PMD_PMD1_Pos           2                                           /*!< GPIO PMD: PMD1 Position */
#define GPIO_PMD_PMD1_Msk           (0x3ul << GPIO_PMD_PMD1_Pos)                /*!< GPIO PMD: PMD1 Mask */

#define GPIO_PMD_PMD0_Pos           0                                           /*!< GPIO PMD: PMD0 Position */
#define GPIO_PMD_PMD0_Msk           (0x3ul << GPIO_PMD_PMD0_Pos)                /*!< GPIO PMD: PMD0 Mask */

/* GPIO OFFD Bit Field Definitions */
#define GPIO_OFFD_OFFD_Pos          16                                          /*!< GPIO OFFD: OFFD Position */
#define GPIO_OFFD_OFFD_Msk          (0xFFul << GPIO_OFFD_OFFD_Pos)              /*!< GPIO OFFD: OFFD Mask */

/* GPIO DOUT Bit Field Definitions */
#define GPIO_DOUT_DOUT_Pos          0                                           /*!< GPIO DOUT: DOUT Position */
#define GPIO_DOUT_DOUT_Msk          (0xFFul << GPIO_DOUT_DOUT_Pos)              /*!< GPIO DOUT: DOUT Mask */

/* GPIO DMASK Bit Field Definitions */
#define GPIO_DMASK_DMASK_Pos        0                                           /*!< GPIO DMASK: DMASK Position */
#define GPIO_DMASK_DMASK_Msk        (0xFFul << GPIO_DMASK_DMASK_Pos)            /*!< GPIO DMASK: DMASK Mask */

/* GPIO PIN Bit Field Definitions */
#define GPIO_PIN_PIN_Pos            0                                           /*!< GPIO PIN: PIN Position */
#define GPIO_PIN_PIN_Msk            (0xFFul << GPIO_PIN_PIN_Pos)                /*!< GPIO PIN: PIN Mask */

